In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.3.1-cp312-cp312-macosx_11_0_arm64.whl.metadata (91 kB)
Requirement already satisfied: numpy>=1.26.0 in /Users/interlink/Desktop/ML_PYTHON_01/venv/lib/python3.12/site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/interlink/Desktop/ML_PYTHON_01/venv/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /Users/interlink/Desktop/ML_PYTHON_01/venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.1-cp312-cp312-macosx_11_0_arm64.whl (10.7 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 10.7/10.7 MB 95.1 kB/s eta 0:00:0000:0300:06
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3/3 [pandas]2m2/3 [pandas]
Successfully installed pandas-2.3.1 pytz-2025.2 tzdata-2025.2

## Pandas
##### Pandas is a powerful data manipulation library in Python, widely used for data analysis and cleaning. It provides two primary data structures: Series and DataFrame.

## Pandas Series
#### A pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table. The basic difference between a Series and a DataFrame is that a Series is one-dimensional, while a DataFrame is two-dimensional, mutable, and can contain heterogeneous data.

In [2]:
import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series \n",series)
## the first 0,1,2,3,4 is defualt index number
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
# create a series with dictionary
data = {'a':1, 'b':2, 'c':3}
series_data = pd.Series(data)
print(series_data)
## now here a,b,c are the index numbers and 1,2,3 are the series values

a    1
b    2
c    3
dtype: int64

## Custom Index in Series
##### You can assign a custom index to a Series by passing the index parameter.

In [4]:
data = [10,20,30]
index = ['a','b','c']
customIndex = pd.Series(data,index=index)
print(customIndex)

a    10
b    20
c    30
dtype: int64

## Pandas DataFrame
##### A DataFrame is a two-dimensional, mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns). It is similar to a table in a database or an Excel sheet.

### Creating a DataFrame from a Dictionary of Lists
##### You can create a DataFrame by passing a dictionary where the values are lists.

In [7]:
## DataFrame with dictinoary of list
data3 = {
    'Name': ['Rasheed Ahmad','Muhammad Bilal','Muazzam Ali'],
    'Age': [20,21,21],
    'City': ['Peshawar','Shangla','Shangla']
}
df = pd.DataFrame(data3)
print(df)

             Name  Age      City
0   Rasheed Ahmad   20  Peshawar
1  Muhammad Bilal   21   Shangla
2     Muazzam Ali   21   Shangla

In [3]:
## Now DataFrame with List of dictinoary
data2 = [
    {'Name': 'Rasheed Ahmad','Age': 20,'City': 'Peshawar'},
    {'Name': 'Jamal Shah','Age': 20,'City': 'Peshawar'},
    {'Name': 'Muhammad Ali','Age': 22,'City': 'Islamabad'}
]
df = pd.DataFrame(data2)
df

            Name  Age       City
0  Rasheed Ahmad   20   Peshawar
1     Jamal Shah   20   Peshawar
2   Muhammad Ali   22  Islamabad

In [8]:
## we can convert into array also
import numpy as np
np.array(df)

array([['Rasheed Ahmad', 20, 'Peshawar'],
       ['Jamal Shah', 20, 'Peshawar'],
       ['Muhammad Ali', 22, 'Islamabad']], dtype=object)

In [9]:
import pandas as pd

In [14]:
df = pd.read_csv('sales_data_sample.csv')
df.head(5)

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [15]:
df.tail(3)

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

In [17]:
data3

{'Name': ['Rasheed Ahmad', 'Muhammad Bilal', 'Muazzam Ali'],
 'Age': [20, 21, 21],
 'City': ['Peshawar', 'Shangla', 'Shangla']}

In [10]:
df

            Name  Age       City
0  Rasheed Ahmad   20   Peshawar
1     Jamal Shah   20   Peshawar
2   Muhammad Ali   22  Islamabad

In [14]:
df['Name']

0    Rasheed Ahmad
1       Jamal Shah
2     Muhammad Ali
Name: Name, dtype: object

In [ ]:
df.iat[2,2]

'Islamabad'

In [4]:
df.at[2,'Name']

'Muhammad Ali'

In [5]:
df

            Name  Age       City
0  Rasheed Ahmad   20   Peshawar
1     Jamal Shah   20   Peshawar
2   Muhammad Ali   22  Islamabad

In [6]:
df['Salary'] = [60000,45000,23000]
df

            Name  Age       City  Salary
0  Rasheed Ahmad   20   Peshawar   60000
1     Jamal Shah   20   Peshawar   45000
2   Muhammad Ali   22  Islamabad   23000

In [8]:
df.drop('Salary' , axis=1,inplace=True)
df

            Name  Age       City
0  Rasheed Ahmad   20   Peshawar
1     Jamal Shah   20   Peshawar
2   Muhammad Ali   22  Islamabad

In [9]:
df.drop(1,inplace=True)
df

            Name  Age       City
0  Rasheed Ahmad   20   Peshawar
2   Muhammad Ali   22  Islamabad

In [12]:
df['Age'] = df['Age'] + 1
df

            Name  Age       City
0  Rasheed Ahmad   21   Peshawar
2   Muhammad Ali   23  Islamabad